# инроспекция функций
def factorian(n):
    ''' :return n'''
    return 1 if n < 2 else n * factorian(n-1)


def main():
    ''' просмотреть все доступные методы '''
    print(dir(factorian))
    print(factorian.__qualname__)
    # __dict__ -> хранятся ассоциированые пользовательские данные ( аннотации )
    # __closure__ -> замыкание функции
    # __defaults__ -> значение параметров по-умолчанию
    # __get__ -> реализация протокола дескриптора для чтения
    # __name__ -> Имя функции
    # __qualname__ -> полное имя функции ( включает класс и метод класса )


if __name__ == '__main__':
    main()